__tests__/load.artillery.test.yml
config:
  target: "https://staging.api.voyagerota.com/internal/api/v1/releases"
  phases:
    - duration: 30
      arrivalRate: 10

    - duration: 60
      arrivalRate: 20

  defaults:
    headers:
      Content-Type: "application/json"
      X-API-KEY: "project-api-key-here......"
      X-PROJECT-ID: "project-id-here......"

scenarios:
  - flow:
      - get:
          url: "/latest?channel=production"
      - think: "{{ $randomNumber(2, 5) }}"